cmsis-svd/cmsis-svd/data/GigaDevice/GD32E50x_CL.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SLAVE_TIMER0</name>
      <description>SHRTIMER  Slave TIMER0 registers(</description>
      <groupName>SHRTIMER</groupName>
      <baseAddress>0x40017480</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SHRTIMER_IRQ1</name>       
        <value>77</value>
      </interrupt>
      <registers>
        <register>
          <name>ST0CTL0</name>
          <displayName>ST0CTL0</displayName>
          <description>SHRTIMER Slave_TIMER0 control register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
           <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPSEL</name>
              <description>Update event selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>     
            <field>
              <name>SHWEN</name>
              <description>Shadow registers enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DACTRGS</name>
              <description>Trigger source to DAC</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>   
            <field>
              <name>UPBMT</name>
              <description>Update by Master_TIMER update event</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPBST4</name>
              <description>Update by Slave_TIMER4 update event</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>UPBST3</name>
              <description>Update by Slave_TIMER3 update event</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>     
            <field>
              <name>UPBST2</name>
              <description>Update by Slave_TIMER2 update event</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>UPBST1</name>
              <description>Update by Slave_TIMER1 update event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>UPRST</name>
              <description>Update event generated by reset event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>   
            </field>
            <field>
              <name>UPREP</name>
              <description>Update event generated by repetition event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DELCMP3M</name>
              <description>Compare 3 delayed mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>   
            </field> 
            <field>
              <name>DELCMP1M</name>
              <description>Compare 1 delayed mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>   
            </field> 
            <field>
              <name>SYNISTRT</name>
              <description>Synchronization input start counter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>SYNIRST</name>
              <description>Synchronization input reset counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>BLNMEN</name>
              <description>Balanced mode enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>   
            </field>
            <field>
              <name>HALFM</name>
              <description>Half mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>CNTRSTM</name>
              <description>Counter reset mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>   
            </field>   
            <field>
              <name>CTNM</name>
              <description>Continuous mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>CNTCKDIV</name>
              <description>Counter clock division</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>   
            </field>                 
          </fields>
        </register>
        <register>
          <name>ST0INTF</name>
          <displayName>ST0INTF</displayName>
          <description>SHRTIMER Slave_TIMER0 interrupt flag register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH1F</name>
              <description>Channel 1 output flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0F</name>
              <description>Channel 0 output flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>BLNIF</name>
              <description>Balanced IDLE flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CBLNF</name>
              <description>Current balanced flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYIIF</name>
              <description>Delayed IDLE mode entry interrupt flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTIF</name>
              <description>Counter reset interrupt flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1ONAIF</name>
              <description>Channel 1 output inactive interrupt flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1OAIF</name>
              <description>Channel 1 output active interrupt flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0ONAIF</name>
              <description>Channel 0 output inactive interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>CH0OAIF</name>
              <description>Channel 0 output active interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CAP1IF</name>
              <description>Capture 1 interrupt flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP0IF</name>
              <description>Capture 0 interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPIF</name>
              <description>Update interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
           <field>
              <name>REPIF</name>
              <description>Repetition interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3IF</name>
              <description>Compare 3 interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2IF</name>
              <description>Compare 2 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1IF</name>
              <description>Compare 1 interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0IF</name>
              <description>Compare 0 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0INTC</name>
          <displayName>ST0INTC</displayName>
          <description>SHRTIMER Slave_TIMER0 interrupt flag clear register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DLYIIFC</name>
              <description>Clear delayed IDLE mode entry interrupt flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTIFC</name>
              <description>Clear counter reset interrupt flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>CH1ONAIFC</name>
              <description>Clear channel 1 output inactive interrupt flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CH1OAIFC</name>
              <description>Clear channel 1 output active interrupt flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0ONAIFC</name>
              <description>Clear channel 0 output inactive interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0OAIFC</name>
              <description>Clear channel 0 output active interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP1IFC</name>
              <description>Clear capture 1 interrupt flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP0IFC</name>
              <description>Clear capture 0 interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPIFC</name>
              <description>Clear update interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>     
           <field>
              <name>REPIFC</name>
              <description>Clear repetition interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3IFC</name>
              <description>Clear compare 3 interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2IFC</name>
              <description>Clear compare 2 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1IFC</name>
              <description>Clear compare 1 interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0IFC</name>
              <description>Clear compare 0 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0DMAINTEN</name>
          <displayName>ST0DMAINTEN</displayName>
          <description>SHRTIMER Slave_TIMER0 DMA and interrupt enable register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DLYIDEN</name>
              <description>Delayed IDLE mode entry DMA request enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTDEN</name>
              <description>Counter reset DMA request enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>CH1ONADEN</name>
              <description>Channel 1 output inactive DMA request enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CH1OADEN</name>
              <description>Channel 1 output active DMA request enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0ONADEN</name>
              <description>Channel 0 output inactive DMA request enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0ADEN</name>
              <description>Channel 0 output active DMA request enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP1DEN</name>
              <description>Capture 1 DMA request enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP0DEN</name>
              <description>Capture 0 DMA request enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPDEN</name>
              <description>Update DMA request enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
           <field>
              <name>REPDEN</name>
              <description>Repetition DMA request enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3DEN</name>
              <description>Compare 3 DMA request enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2DEN</name>
              <description>Compare 2 DMA request enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1DEN</name>
              <description>Compare 1 DMA request enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0DEN</name>
              <description>Compare 0 DMA request enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYIIE</name>
              <description>Delayed IDLE mode entry interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTIE</name>
              <description>Counter reset interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>CH1ONAIE</name>
              <description>Channel 1 output inactive interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CH1OAIE</name>
              <description>Channel 1 output active interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0ONAIE</name>
              <description>Channel 0 output inactive interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0OAIE</name>
              <description>Channel 0 output active interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP1IE</name>
              <description>Capture 1 interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP0IE</name>
              <description>Capture 0 interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPIE</name>
              <description>Update interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
           <field>
              <name>REPIE</name>
              <description>Repetition interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3IE</name>
              <description>Compare 3 interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2IE</name>
              <description>Compare 2 interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1IE</name>
              <description>Compare 1 interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0IE</name>
              <description>Compare 0 interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0CNT</name>
          <displayName>ST0CNT</displayName>
          <description>SHRTIMER Slave_TIMER0 counter register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>The current counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0CAR</name>
          <displayName>ST0CAR</displayName>
          <description>SHRTIMER Slave_TIMER0 counter auto reload register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARL</name>
              <description>Counter auto reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0CREP</name>
          <displayName>ST0CREP</displayName>
          <description>SHRTIMER Slave_TIMER0 counter repetition register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CREP</name>
              <description>Counter repetition value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0CMP0V</name>
          <displayName>ST0CMP0V</displayName>
          <description>SHRTIMER Slave_TIMER0 compare 0 value register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP0VAL</name>
              <description>Compare 0 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ST0CMP0CP</name>
          <displayName>ST0CMP0CP</displayName>
          <description>SHRTIMER Slave_TIMER0 compare 0 composite register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CREP</name>
              <description>Counter repetition value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CMP0VAL</name>
              <description>Compare 0 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
