cmsis-svd/cmsis-svd/data/GigaDevice/GD32E50x_CL.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>SHRTIMER_COMMON</name>
      <description>SHRTIMER Common registers</description>
      <groupName>SHRTIMER</groupName>
      <baseAddress>0x40017780</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SHRTIMER_IRQ6</name>       
        <value>73</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL0</name>
          <displayName>CTL0</displayName>
          <description>SHRTIMER control register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADTG3USRC</name>
              <description>SHRTIMER_ADCTRIG3 update source</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ADTG2USRC</name>
              <description>SHRTIMER_ADCTRIG2 update source</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ADTG1USRC</name>
              <description>SHRTIMER_ADCTRIG1 update source</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
             <field>
              <name>ADTG0USRC</name>
              <description>SHRTIMER_ADCTRIG0 update source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ST4UPDIS</name>
              <description>Slave_TIMER4 update disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3UPDIS</name>
              <description>Slave_TIMER3 update disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2UPDIS</name>
              <description>Slave_TIMER2 update disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0UPDIS</name>
              <description>Slave_TIMER0 update disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTUPDIS</name>
              <description>Master_TIMER update disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>SHRTIMER control register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST4SRST</name>
              <description>Slave_TIMER4 software reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3SRST</name>
              <description>Slave_TIMER3 software reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2SRST</name>
              <description>Slave_TIMER2 software reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1SRST</name>
              <description>Slave_TIMER1 software reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0SRST</name>
              <description>Slave_TIMER0 software reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTSRST</name>
              <description>Master_TIMER software reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4SUP</name>
              <description>Slave_TIMER4 software update</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3SUP</name>
              <description>Slave_TIMER3 software update</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2SUP</name>
              <description>Slave_TIMER2 software update</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1SUP</name>
              <description>Slave_TIMER1 software update</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0SUP</name>
              <description>Slave_TIMER0 software update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTSUP</name>
              <description>Master_TIMER software update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>INTF</name>
          <displayName>INTF</displayName>
          <description>SHRTIMER interrupt flag register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMPERIF</name>
              <description>Bunch mode period interrupt flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLCALIF</name>
              <description>DLL calibration completed interrupt flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSFLTIF</name>
              <description>System fault interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4IF</name>
              <description>Fault 4 interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3IF</name>
              <description>Fault 3 interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2IF</name>
              <description>Fault 2 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT1IF</name>
              <description>Fault 1 interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT0IF</name>
              <description>Fault 0 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>INTC</name>
          <displayName>INTC</displayName>
          <description>SHRTIMER interrupt flag clear register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMPERIFC</name>
              <description>Clear bunch mode period interrupt flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLCALIF</name>
              <description>Clear DLL calibration completed interrupt flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSFLTIFC</name>
              <description>Clear system fault interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4IFC</name>
              <description>Clear fault 4 interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3IFC</name>
              <description>Clear fault 3 interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2IFC</name>
              <description>Clear fault 2 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT1IF</name>
              <description>Fault 1 interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT0IFC</name>
              <description>Fault 0 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>SHRTIMER interrupt enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMPERIE</name>
              <description>Bunch mode period interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLLCALIE</name>
              <description>DLL calibration completed interrupt enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSFLTIE</name>
              <description>System fault interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT4IE</name>
              <description>Fault 4 interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT3IE</name>
              <description>Fault 3 interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT2IE</name>
              <description>Fault 2 interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT1IE</name>
              <description>Fault 1 interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLT0IE</name>
              <description>Fault 0 interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>CHOUTEN</name>
          <displayName>CHOUTEN</displayName>
          <description>SHRTIMER channel output enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST4CH1EN</name>
              <description>Slave_TIMER4 channel 1 output (ST4CH1_O) enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CH0EN</name>
              <description>Slave_TIMER4 channel 0 output (ST4CH0_O) enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH1EN</name>
              <description>Slave_TIMER3 channel 1 output (ST3CH1_O) enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH0EN</name>
              <description>Slave_TIMER3 channel 0 output (ST3CH0_O) enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH1EN</name>
              <description>Slave_TIMER2 channel 1 output (ST2CH1_O) enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH0EN</name>
              <description>Slave_TIMER2 channel 0 output (ST2CH0_O) enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH1EN</name>
              <description>Slave_TIMER1 channel 1 output (ST1CH1_O) enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH0EN</name>
              <description>Slave_TIMER1 channel 0 output (ST1CH0_O) enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH1EN</name>
              <description>Slave_TIMER0 channel 1 output (ST0CH1_O) enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH0EN</name>
              <description>Slave_TIMER0 channel 0 output (ST0CH0_O) enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>CHOUTDIS</name>
          <displayName>CHOUTDIS</displayName>
          <description>SHRTIMER channel output disable register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST4CH1DIS</name>
              <description>Slave_TIMER4 channel 1 output (ST4CH1_O) disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CH0DIS</name>
              <description>Slave_TIMER4 channel 0 output (ST4CH0_O) disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH1DIS</name>
              <description>Slave_TIMER3 channel 1 output (ST3CH1_O) disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH0DIS</name>
              <description>Slave_TIMER3 channel 0 output (ST3CH0_O) disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH1DIS</name>
              <description>Slave_TIMER2 channel 1 output (ST2CH1_O) disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH0DIS</name>
              <description>Slave_TIMER2 channel 0 output (ST2CH0_O) disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH1DIS</name>
              <description>Slave_TIMER1 channel 1 output (ST1CH1_O) disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH0DIS</name>
              <description>Slave_TIMER1 channel 0 output (ST1CH0_O) disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH1DIS</name>
              <description>Slave_TIMER0 channel 1 output (ST4CH0_O) disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH0DIS</name>
              <description>Slave_TIMER0 channel 0 output (ST0CH0_O) disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>CHOUTDISF</name>
          <displayName>CHOUTDISF</displayName>
          <description>SHRTIMER channel output disable flag register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ST4CH1DISF</name>
              <description>Slave_TIMER4 channel 1 output (ST4CH1_O) disable flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST4CH0DISF</name>
              <description>Slave_TIMER4 channel 0 output (ST4CH0_O) disable flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH1DISF</name>
              <description>Slave_TIMER3 channel 1 output (ST3CH1_O) disable flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST3CH0DISF</name>
              <description>Slave_TIMER3 channel 0 output (ST3CH0_O) disable flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH1DISF</name>
              <description>Slave_TIMER2 channel 1 output (ST2CH1_O) disable flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST2CH0DISF</name>
              <description>Slave_TIMER2 channel 0 output (ST2CH0_O) disable flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH1DISF</name>
              <description>Slave_TIMER1 channel 1 output (ST1CH1_O) disable flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST1CH0DISF</name>
              <description>Slave_TIMER1 channel 0 output (ST1CH0_O) disable flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH1DISF</name>
              <description>Slave_TIMER0 channel 1 output (ST0CH1_O) disable flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST0CH0DISF</name>
              <description>Slave_TIMER0 channel 0 output (ST0CH0_O) disable flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

