cmsis-svd/cmsis-svd/data/GigaDevice/GD32E50x_CL.svd
        <register>
          <name>STATC</name>
          <displayName>STATC</displayName>
          <description>Status clear register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMBALTC</name>
              <description>SMBus Alert flag clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMEOUTC</name>
              <description>TIMEOUT flag clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PECERRC</name>
              <description>PEC error flag clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUERRC</name>
              <description>Overrun/Underrun flag clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOSTARBC</name>
              <description>Arbitration Lost flag clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERRC</name>
              <description>Bus error flag clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STPDETC</name>
              <description>STPDET flag clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACKC</name>
              <description>Not Acknowledge flag clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDSENDC</name>
              <description>ADDSEND flag clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEC</name>
          <displayName>PEC</displayName>
          <description>Packet Error Checking</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PECV</name>
              <description>Packet Error Checking Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <displayName>RDATA</displayName>
          <description>receive data register </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Receive data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TDATA</name>
          <displayName>TDATA</displayName>
          <description>Transmit data register </description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TDATA</name>
              <description>Transmit data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU</name>
      <description>Power management unit</description>
      <groupName>PMU</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL0</name>
          <displayName>CTL0</displayName>
          <description>power control register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000C000</resetValue>
          <fields>
            <field>
              <name>LDEN</name>
              <description>Low-driver mode enable in Deep-sleep mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HDS</name>
              <description>High-driver mode switch</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEN</name>
              <description>High-driver mode enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>LDNP</name>
              <description>Low-driver mode when use normal power LDO</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDLP</name>
              <description>Low-driver mode when use low power LDO.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPWEN</name>
              <description>Backup Domain Write Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVDT</name>
              <description>Low Voltage Detector Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LVDEN</name>
              <description>Low Voltage Detector Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STBRST</name>
              <description>Standby Flag Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WURST</name>
              <description>Wakeup Flag Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STBMOD</name>
              <description>Standby Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDOLP</name>
              <description>LDO Low Power Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CS0</name>
          <displayName>CS0</displayName>
          <description>power control/status register 0</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
          <field>
              <name>LDRF</name>
              <description>Low-driver mode ready flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDSRF</name>
              <description>High-driver switch ready flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDRF</name>
              <description>High-driver ready flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUPEN7</name>
              <description>Enable WKUP Pin7(PF8)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN5</name>
              <description>Enable WKUP pin5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN4</name>
              <description>Enable WKUP pin4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN3</name>
              <description>Enable WKUP pin3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN2</name>
              <description>Enable WKUP pin2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN1</name>
              <description>Enable WKUP pin1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN0</name>
              <description>Enable WKUP pin0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN6</name>
              <description>Enable WKUP pin6</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDF</name>
              <description>Low Voltage Detector Status Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBF</name>
              <description>Standby flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF</name>
              <description>Wakeup flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>power control register 1</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPMOD2</name>
              <description>Enable deep-sleep 2 mode </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPMOD1</name>
              <description>Enable deep-sleep 1 mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CS1</name>
          <displayName>CS1</displayName>
          <description>power control and status register 1</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPF2</name>
              <description>Deep-sleep 2 mode status flag </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPF1</name>
              <description>Deep-sleep1 mode status flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
